supervision/summer2020krasi/presentation_notes.org
#+OPTIONS: H:2 toc:nil
#+LATEX_CLASS: beamer
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+BEAMER_THEME: UoB
#+AUTHOR: Mark Blyth
#+TITLE: PRESENTATION NOTES, DON'T DISPLAY THESE!
#+DATE: [2020-08-03 Mon]

* Last time
** Last meeting
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Last time: 
      
    * The challenges of working with spiking signals
      * Lots of high-frequency energy
      * Typically noisy, both from stochastics and from measurement errors
      * Lots of high-frequency components mean a LP filter will remove the signal, as well as noise, so we can't naively clean up the signal
      * Also means using a truncated Fourier discretisation will be infeasible, since it'll have far too many components to effectively discretise
      
    * Surrogate methods to overcome these:
      * Use a regression model in place of the real data
      * Perform desired analysis on this instead
      * `Desired analysis' will be explained more later, in a CBC context
      * A well-chosen surrogate will filter out all the noise, without losing any signal
      
** Surrogates point 1
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Given \(y_i = f(x_i) + \varepsilon\), estimate \(f(x)\)
     * We assume there's a `true' underlying signal f(x)
     * This true signal is what the neuron is actually doing, eg. what the membrane potential actually is at the patch clamp location
     * We don't have access to f(x); instead, we get a time-series y_i, of noise-corrupted samples
     * These noise-corrupted samples contain both the actual signal at the given sample time, plus some nuissance variable \(\varepsilon\) from errors in measurement
     * We wish to recover f(x) from these samples, as that's the noise-free, true signal that we're interested in
       * Simply LP filtering would only remove the HF components of f(x) and \varepsilon; instead, we wish to separate the two out into noise and signal
     * We can use statistical methods to infer f(x) and \varepsilon
     * This gives us a clean, noise-free surrogate to perform all the analysis on
     * Surrogate: we use f(x) in place of the real data

** Surrogates point 2
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Splines and Gaussian processes are good methods for estimation
     * GPR: mathematically elegant, rigorous method
       * Assume normally distributed \(\varepsilon\)
       * Point estimate: y ~ N(f(x), \varepsilon)
       * Whole function estimate: f(x) ~ GP(mu, Sigma)
       * Whole function estimate is actually a Gaussian distribution over functions
       * The whole function estimate is just a generalisation of the point estimate
       * For a sensible prior, we can then use Bayes to estimate the posterior distribution on f(x)
       * Statistically optimal estimator
       * Downside: for finite data, results are only as good as the priors we use; coming up with good priors is hard

     * Splines: simple, effective, less elegant
       * Split f(x) into intervals, and asume f(x) is locally polynomial on any given interval
       * Enforce C^2 smoothness over polynomial sections
       * Polynomials then join up at the edges of each interval; these joinings are called knot points
       * Remaining free parameters are chosen to maximise goodness-of-fit
       * No need to define priors, so it's easier to use on data where choice of priors becomes difficult
       * Knot points are difficult to choose; use Bayesian inference to form a posterior distribution over knots

* Novel discretisations
** Developments since last time
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
IMAGE. 
   * Surrogates tested and working
     * GPR works on both real and synthetic data, in cases where the data are sufficiently stationary
     * Free knot splines works always, so use it in cases where the data aren't sufficiently stationary
   
   * Image taken from recent abstract
     * Bayesian free-knot splines
     * Works well -- we can extract the underlying signal near perfectly, even given very noisy observations
     * Three changepoints per period: at the start, top, and end of a spike; here, the signal rapidly changes from slow to fast behaviour
     * These changepoints are the hardest bits to model, and therefore the surrogates are least accurate here (the time between spikes shows a slow, gentle change that's easy to model accurately)
     * Zooming in on one of the changepoints, we see that the surrogate recreates the latent signal nearly exactly; even at the most difficult-to-fit part of the signal, we still get excellent results
       
** Developments since last time
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Novel discretisations
     * Surrogates only give us a noise filter
     * For some CBC implementations, this is sufficient
     * In CBC cases where we have to do Newton iterations, this isn't useful; we instead need a low-dimensional discretisation
     * We can apply the surrogates ideas to creating discretisations
       
   * In-silico CBC
     * Best way to demonstrate that these methods work, are valuable

** Discretisations
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

    * Discretisation takes a function, projects it onto a set of basis functions
    * Coefficients and basis functions are sufficient to represent the signal
    * Lots of possible choices for basis functions
      * C^infinity signals can be represented exactly with monomial basis functions (taylor expansion)
      * Periodic signals can be represented exactly with trig basis functions (Fourier series)
      * These are bad choices for neuron CBC -- require lots of coefficients to describe the spiking signals
    * We've already met splines; turns out we can define a set of basis functions for splines
      * Can therefore express any spline curve in the above form
      * This means we can discretise with splines too!
      * Splines are a good choice: they provide a nice simple, intuitive model, and don't require many basis functions to get a good approximation

