supervision/july2020wk4cbccode/presentation_notes.tex
% Created 2020-07-31 Fri 13:23
% Intended LaTeX compiler: pdflatex
\documentclass[presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usetheme{UoB}
\author{Mark Blyth}
\date{\textit{[2020-08-03 Mon]}}
\title{PRESENTATION NOTES, DON'T DISPLAY THESE!}
\hypersetup{
 pdfauthor={Mark Blyth},
 pdftitle={PRESENTATION NOTES, DON'T DISPLAY THESE!},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Last time}
\label{sec:org3f06930}
\begin{frame}[plain,label={sec:orgaa9fe4c}]{Last meeting}
Last time: 

\begin{itemize}
\item The challenges of working with spiking signals
\begin{itemize}
\item Lots of high-frequency energy
\item Typically noisy, both from stochastics and from measurement errors
\item Lots of high-frequency components mean a LP filter will remove the signal, as well as noise, so we can't naively clean up the signal
\item Also means using a truncated Fourier discretisation will be infeasible, since it'll have far too many components to effectively discretise
\end{itemize}

\item Surrogate methods to overcome these:
\begin{itemize}
\item Use a regression model in place of the real data
\item Perform desired analysis on this instead
\item `Desired analysis' will be explained more later, in a CBC context
\item A well-chosen surrogate will filter out all the noise, without losing any signal
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orga19232b}]{Surrogates point 1}
\begin{itemize}
\item Given \(y_i = f(x_i) + \varepsilon\), estimate \(f(x)\)
\begin{itemize}
\item We assume there's a `true' underlying signal f(x)
\item This true signal is what the neuron is actually doing, eg. what the membrane potential actually is at the patch clamp location
\item We don't have access to f(x); instead, we get a time-series y\(_{\text{i}}\), of noise-corrupted samples
\item These noise-corrupted samples contain both the actual signal at the given sample time, plus some nuissance variable \(\varepsilon\) from errors in measurement
\item We wish to recover f(x) from these samples, as that's the noise-free, true signal that we're interested in
\begin{itemize}
\item Simply LP filtering would only remove the HF components of f(x) and \(\varepsilon\); instead, we wish to separate the two out into noise and signal
\end{itemize}
\item We can use statistical methods to infer f(x) and \(\varepsilon\)
\item This gives us a clean, noise-free surrogate to perform all the analysis on
\item Surrogate: we use f(x) in place of the real data
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org4b2e45f}]{Surrogates point 2}
\begin{itemize}
\item Splines and Gaussian processes are good methods for estimation
\begin{itemize}
\item GPR: mathematically elegant, rigorous method
\begin{itemize}
\item Assume normally distributed \(\varepsilon\)
\item Point estimate: y \textasciitilde{} N(f(x), \(\varepsilon\))
\item Whole function estimate: f(x) \textasciitilde{} GP(mu, Sigma)
\item Whole function estimate is actually a Gaussian distribution over functions
\item The whole function estimate is just a generalisation of the point estimate
\item For a sensible prior, we can then use Bayes to estimate the posterior distribution on f(x)
\item Statistically optimal estimator
\item Downside: for finite data, results are only as good as the priors we use; coming up with good priors is hard
\end{itemize}

\item Splines: simple, effective, less elegant
\begin{itemize}
\item Split f(x) into intervals, and asume f(x) is locally polynomial on any given interval
\item Enforce C\(^{\text{2}}\) smoothness over polynomial sections
\item Polynomials then join up at the edges of each interval; these joinings are called knot points
\item Remaining free parameters are chosen to maximise goodness-of-fit
\item No need to define priors, so it's easier to use on data where choice of priors becomes difficult
\item Knot points are difficult to choose; use Bayesian inference to form a posterior distribution over knots
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}

\section{Novel discretisations}
\label{sec:org34ac465}
\begin{frame}[plain,label={sec:orgd8a879e}]{Developments since last time}
IMAGE. 
\begin{itemize}
\item Surrogates tested and working
\begin{itemize}
\item GPR works on both real and synthetic data, in cases where the data are sufficiently stationary
\item Free knot splines works always, so use it in cases where the data aren't sufficiently stationary
\end{itemize}

\item Image taken from recent abstract
\begin{itemize}
\item Bayesian free-knot splines
\item Works well -- we can extract the underlying signal near perfectly, even given very noisy observations
\item Three changepoints per period: at the start, top, and end of a spike; here, the signal rapidly changes from slow to fast behaviour
\item These changepoints are the hardest bits to model, and therefore the surrogates are least accurate here (the time between spikes shows a slow, gentle change that's easy to model accurately)
\item Zooming in on one of the changepoints, we see that the surrogate recreates the latent signal nearly exactly; even at the most difficult-to-fit part of the signal, we still get excellent results
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orgac8f0c5}]{Developments since last time}
\begin{itemize}
\item Novel discretisations
\begin{itemize}
\item Surrogates only give us a noise filter
\item For some CBC implementations, this is sufficient
\item In CBC cases where we have to do Newton iterations, this isn't useful; we instead need a low-dimensional discretisation
\item We can apply the surrogates ideas to creating discretisations
\end{itemize}

\item In-silico CBC
\begin{itemize}
\item Best way to demonstrate that these methods work, are valuable
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orgace675d}]{Discretisations}
\begin{itemize}
\item Discretisation takes a function, projects it onto a set of basis functions
\item Coefficients and basis functions are sufficient to represent the signal
\item Lots of possible choices for basis functions
\begin{itemize}
\item C\(^{\text{infinity}}\) signals can be represented exactly with monomial basis functions (taylor expansion)
\item Periodic signals can be represented exactly with trig basis functions (Fourier series)
\item These are bad choices for neuron CBC -- require lots of coefficients to describe the spiking signals
\end{itemize}
\item We've already met splines; turns out we can define a set of basis functions for splines
\begin{itemize}
\item Can therefore express any spline curve in the above form
\item This means we can discretise with splines too!
\item Splines are a good choice: they provide a nice simple, intuitive model, and don't require many basis functions to get a good approximation
\end{itemize}
\end{itemize}
\end{frame}
