supervision/summer2020krasi/presentation_notes.org
** Splines discretisation
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
    * Fit a set of basis functions to initial signal \(f_0(x)\)
      * *Choose a set of knots xi, such that the splines basis b_i(x) that we construct from knots xi is able to fit the initial signal f_0(x) as accurately as possible, in the least squares sense*
      * This is actually hard to do -- open research problem
      * Elegant approach: find a Bayesian posterior over \(\xi | data\). Downside: is slow and complicated; need to do MCMC to approximate intractable integral
      * Simple approach 1: put a knot at every datapoint then penalise functional of second derivative, to enforce smoothness. Downside: we end up with huge numbers of knots.
      * Simple approach 2: keep adding knots  until we reach satisfactory results; downside: lower quality fit, no guarantee of low-dimensionality
    * My approach: choose the number of knots; numerically optimise knot positions; start from random initial knots; avoid local minima by repeating this lots
      * Downside: need to repeat lots to find global minimum
      * Need to choose the number of knots a priori; algo doesn't work it out for us
      * Upside: quick and easy approach to finding a good set of knots; easiest way to get low-dimensional knot set
** Splines demo
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
  * Splines discretisation works well
  * This example uses just 8 knot points
    * Higher than an 8d discretisation, as we need to add exterior knots so that the basis splines have support across the range of the data
  * Reconstructs the latent signal near-perfectly

** Splines vs Fourier
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
Also shown: Fourier

     * Visually, splines fits better than Fourier
     * Fourier is harder to fit
     * Too few harmonics and the series can't fit the data
     * Too many harmonics and the series starts fitting the noise as well as the data
     * Not really any sweet spot; no point where the series fits the signal, but averages out the noise
     * This is the usage case for surrogates -- when we have noisy data, but still want to use Fourier with it!

** Goodness-of-fit       
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
This shows the goodness-of-fit of a splines model with given number of knots, and Fourier series with given number of harmonics

    * No noise, Fitzhugh Nagumo
    * Splines error decays more rapidly than Fourier error
    * Effects become even more dramatic for more neuron-like signals
    * Note though this is the goodness-of-fit of a splines, fourier model on a single signal; doesn't determine how well the splines model generalises to discretising unseen signals, ie. only shows how well the spline model fits a signal to which its basis functions were fitted; using the same basis functions on a signal from a different parameter value might get different goodness-of-fit. Fourier won't have this issue since it uses trig basis all the time

** Method usage cases
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
    * Harmonically forced:
      * When we have a harmonically forced system, we can have a harmonically oscillating control action, and treat the control action as the forcing term
      * In this setup, we can efficiently iterate on the Fourier harmonics, to drive the higher-order harmonics of the control action to zero
      * This necessitates a Fourier projection. No need for a novel discretisation, but we could possibly improve the Fourier discretisation by using a surrogate to first filter off the noise

    * Non-harmonically forced:
      * If system is unforced, we apply parameter and control action separately, and need the control action to be zero
      * We can use Newton iterations to solve for the noninvasive control action
      * Since we're doing Newton iterations, we need to work with a low dimensional system, otherwise it'll be impractically slow
      * To have a low-dimensional system, we use a novel discretisation, eg. splines
* CBC approach
** /In-silico/ CBC
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

Current work: implementing an in-silico CBC simulation
    * Best way to test if the surrogates, discretisations work with CBC is to try using them with CBC!

** CBC method POINTS 1, 2
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Use PD control
     * Easy, model-free control method
     * Gets good results with a method we could easily use in experiments too
     * Fit control parameters with brute force
     * Easy to simulate, minimal effort in controller design

   * As per standard numerical continuation, do a change in variables so that time is in [0,1], and treat period as an extra continuation variable
     * Not necessary with Fourier discretisation
     * Splines knots are like finite-differences or collocation mesh points
     * Time rescaling is necessary with mesh-based methods, as changing the period would effectively move the mesh points relative to the signal
     
** CBC method POINTS 3, 4
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Non-adaptive mesh
     * Fit knots at the start, keep them in the same position throughout
     * Adaptive mesh would mean re-fitting the knots after a prediction-correction step
     * In terms of code, this is minimal extra effort, but would add a slight fitting overhead
     * Only using non-adaptive mesh because I'm interested to see how well it works

   * Use Newton iterations to solve for discretised control target = discretised system output
     * Nothing fancy, just simple, slow Newton with finite differences; able to do this in-silico, but would need more rigorous treatment for experiments
     * Sensible to start off with easy root finding, and develop something fancy (Broyden) later
     * Splines method adds exterior knots, and some of the coefficients are always zero, so they can be removed from the discretisation to speed up the finite-differences Jacobian step; I'm currently being lazy and not doing this
* Code progress
** Discretisors
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
    * Instantiate desired discretisor type with its relevant parameter
      * Fourier: n_harmonics
      * Splines: knot locations
      * Regardless of discretisor type, can then call discretisor discretise, discretisor undiscretise

    * Simple, standard interface to discretisation routines
      * Able to swap between Fourier, Splines with zero effort
      * Allows direct comparison between discretisation methods
      * Could easily implement any other discretisation (eg. wavelets) using the same interface

    * Lightly tested:
      * The code runs and produces sensible outputs
      * Haven't tested its ability to generalise to new signals
      * Ie. don't know how well basis funcs fitted to f_0(x) will work for discretising f_1(x)
