supervision/july2020wk4cbccode/presentation_notes.tex

\begin{frame}[plain,label={sec:orgd6955eb}]{Splines discretisation}
\begin{itemize}
\item Fit a set of basis functions to initial signal \(f_0(x)\)
\begin{itemize}
\item \alert{Choose a set of knots xi, such that the splines basis b\(_{\text{i}}\)(x) that we construct from knots xi is able to fit the initial signal f\(_{\text{0}}\)(x) as accurately as possible, in the least squares sense}
\item This is actually hard to do -- open research problem
\item Elegant approach: find a Bayesian posterior over \(\xi | data\). Downside: is slow and complicated; need to do MCMC to approximate intractable integral
\item Simple approach 1: put a knot at every datapoint then penalise functional of second derivative, to enforce smoothness. Downside: we end up with huge numbers of knots.
\item Simple approach 2: keep adding knots  until we reach satisfactory results; downside: lower quality fit, no guarantee of low-dimensionality
\end{itemize}
\item My approach: choose the number of knots; numerically optimise knot positions; start from random initial knots; avoid local minima by repeating this lots
\begin{itemize}
\item Downside: need to repeat lots to find global minimum
\item Need to choose the number of knots a priori; algo doesn't work it out for us
\item Upside: quick and easy approach to finding a good set of knots; easiest way to get low-dimensional knot set
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[plain,label={sec:org36930a4}]{Splines demo}
\begin{itemize}
\item Splines discretisation works well
\item This example uses just 8 knot points
\begin{itemize}
\item Higher than an 8d discretisation, as we need to add exterior knots so that the basis splines have support across the range of the data
\end{itemize}
\item Reconstructs the latent signal near-perfectly
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org66af2fa}]{Splines vs Fourier}
Also shown: Fourier

\begin{itemize}
\item Visually, splines fits better than Fourier
\item Fourier is harder to fit
\item Too few harmonics and the series can't fit the data
\item Too many harmonics and the series starts fitting the noise as well as the data
\item Not really any sweet spot; no point where the series fits the signal, but averages out the noise
\item This is the usage case for surrogates -- when we have noisy data, but still want to use Fourier with it!
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org0d501d7}]{Goodness-of-fit}
This shows the goodness-of-fit of a splines model with given number of knots, and Fourier series with given number of harmonics

\begin{itemize}
\item No noise, Fitzhugh Nagumo
\item Splines error decays more rapidly than Fourier error
\item Effects become even more dramatic for more neuron-like signals
\item Note though this is the goodness-of-fit of a splines, fourier model on a single signal; doesn't determine how well the splines model generalises to discretising unseen signals, ie. only shows how well the spline model fits a signal to which its basis functions were fitted; using the same basis functions on a signal from a different parameter value might get different goodness-of-fit. Fourier won't have this issue since it uses trig basis all the time
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org6e32cd1}]{Method usage cases}
\begin{itemize}
\item Harmonically forced:
\begin{itemize}
\item When we have a harmonically forced system, we can have a harmonically oscillating control action, and treat the control action as the forcing term
\item In this setup, we can efficiently iterate on the Fourier harmonics, to drive the higher-order harmonics of the control action to zero
\item This necessitates a Fourier projection. No need for a novel discretisation, but we could possibly improve the Fourier discretisation by using a surrogate to first filter off the noise
\end{itemize}

\item Non-harmonically forced:
\begin{itemize}
\item If system is unforced, we apply parameter and control action separately, and need the control action to be zero
\item We can use Newton iterations to solve for the noninvasive control action
\item Since we're doing Newton iterations, we need to work with a low dimensional system, otherwise it'll be impractically slow
\item To have a low-dimensional system, we use a novel discretisation, eg. splines
\end{itemize}
\end{itemize}
\end{frame}
\section{CBC approach}
\label{sec:orgd207c9d}
\begin{frame}[plain,label={sec:orgaffdccc}]{\emph{In-silico} CBC}
Current work: implementing an in-silico CBC simulation
\begin{itemize}
\item Best way to test if the surrogates, discretisations work with CBC is to try using them with CBC!
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orgad84812}]{CBC method POINTS 1, 2}
\begin{itemize}
\item Use PD control
\begin{itemize}
\item Easy, model-free control method
\item Gets good results with a method we could easily use in experiments too
\item Fit control parameters with brute force
\item Easy to simulate, minimal effort in controller design
\end{itemize}

\item As per standard numerical continuation, do a change in variables so that time is in [0,1], and treat period as an extra continuation variable
\begin{itemize}
\item Not necessary with Fourier discretisation
\item Splines knots are like finite-differences or collocation mesh points
\item Time rescaling is necessary with mesh-based methods, as changing the period would effectively move the mesh points relative to the signal
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orgb719042}]{CBC method POINTS 3, 4}
\begin{itemize}
\item Non-adaptive mesh
\begin{itemize}
\item Fit knots at the start, keep them in the same position throughout
\item Adaptive mesh would mean re-fitting the knots after a prediction-correction step
\item In terms of code, this is minimal extra effort, but would add a slight fitting overhead
\item Only using non-adaptive mesh because I'm interested to see how well it works
\end{itemize}

\item Use Newton iterations to solve for discretised control target = discretised system output
\begin{itemize}
\item Nothing fancy, just simple, slow Newton with finite differences; able to do this in-silico, but would need more rigorous treatment for experiments
\item Sensible to start off with easy root finding, and develop something fancy (Broyden) later
\item Splines method adds exterior knots, and some of the coefficients are always zero, so they can be removed from the discretisation to speed up the finite-differences Jacobian step; I'm currently being lazy and not doing this
\end{itemize}
\end{itemize}
\end{frame}
\section{Code progress}
\label{sec:org9cec4fb}
\begin{frame}[plain,label={sec:org02409ff}]{Discretisors}
\begin{itemize}
\item Instantiate desired discretisor type with its relevant parameter
\begin{itemize}
\item Fourier: n\(_{\text{harmonics}}\)
\item Splines: knot locations
\item Regardless of discretisor type, can then call discretisor discretise, discretisor undiscretise
\end{itemize}

\item Simple, standard interface to discretisation routines
\begin{itemize}
\item Able to swap between Fourier, Splines with zero effort
\item Allows direct comparison between discretisation methods
\item Could easily implement any other discretisation (eg. wavelets) using the same interface
\end{itemize}

\item Lightly tested:
\begin{itemize}
\item The code runs and produces sensible outputs
\item Haven't tested its ability to generalise to new signals
\item Ie. don't know how well basis funcs fitted to f\(_{\text{0}}\)(x) will work for discretising f\(_{\text{1}}\)(x)
\end{itemize}
\end{itemize}
\end{frame}
