supervision/summer2020krasi/presentation_notes.org
** Controllers
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
   * Can design controllers with a standard interface too
     * Set the controller type, control target, gains, and the control matrices
     * The controller object handles the rest

   * Similarly, can design systems with a standard interface
     * Specify a function that gives the ODE RHS; a list of ODE parameters; the controller
     * Can then run the controlled model for any choice of time range, ICs, pars
     * Subsequent runs optionally start with ICs given by final state of last run, much like a real system
     
The point of all these standardised interfaces is that it becomes really easy to swap everything out; eg. apply to different models, different control strategies, different discretisors

Can then run a CBC experiment in less than 10 lines of code; easy to apply, reapply, experiment with

** Control
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:
IMAGE

FH system with sine target; looks very reasonable

    * Lightly tested: code runs, results look very reasonable
      * Seems like a sensible output
    * Can easily write out the RHS of a PD-controlled FH system w/ sine target; can compare this explicit RHS to the code-generated system, to make sure the code isn't doing anything funny
      * Haven't done this yet

** Continuation
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

   * Runs a psuedo-arclength secant-predictor Newton-corrector CBC
   * Code is written now
   * Requires a `system': this is just a controlled model [from previous code], with its arguments binded
   * `system' interface will be easy to write, but haven't got round to this yet

** Simulation summary
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

    * Results handling is just something to take the set of natural periodic orbits, apply some measure (eg. amplitude), then plot them on a bifurcation diagram.
    * Should be working and tested within a week

      
* Next steps
** Open questions
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

    * Will splines discretisation work?
      * If splines can only model the signal to which the knots were fitted, they won't work for CBC
      * My guess is they will work

    * Stationary or adaptive mesh?
      * If splines basis aren't good at generalising, can re-fit knots at each step, much like an adaptive mesh, which would hopefully fix problems

    * Efficient solving methods
      * Remove zero-coefficients from discretisation
      * Broyden Jacobian update?
      * Newton-Picard iterations? Ludovic's suggestion of Newton-iterating on unstable coefficients, fixed-point iterating on stable coefficients; reduces the size of the Jacobian / finite differences step

    * Can we interface the code with Simulink?
      * Ludovic has a simulink model that would be fun to play with; haven't looked at it yet since I've been testing the CBC codes; would be interesting to try to call the finished code from MATLAB, in which case we might be able to interface the two

** Next steps
   :PROPERTIES:
   :BEAMER_opt: plain
   :END:

   * Continuation tutorial paper
     * Haven't touched it recently
     * Making slower progress since I'm trying to get the stuff for this done before the paper deadline

   * NODYCON abstract for this: submitted, accepted

   * Conference paper for this: will start on that once the CBC simulation is sorted
