supervision/july2020wk4cbccode/presentation_notes.tex
\begin{frame}[plain,label={sec:org0030b1b}]{Controllers}
\begin{itemize}
\item Can design controllers with a standard interface too
\begin{itemize}
\item Set the controller type, control target, gains, and the control matrices
\item The controller object handles the rest
\end{itemize}

\item Similarly, can design systems with a standard interface
\begin{itemize}
\item Specify a function that gives the ODE RHS; a list of ODE parameters; the controller
\item Can then run the controlled model for any choice of time range, ICs, pars
\item Subsequent runs optionally start with ICs given by final state of last run, much like a real system
\end{itemize}
\end{itemize}

The point of all these standardised interfaces is that it becomes really easy to swap everything out; eg. apply to different models, different control strategies, different discretisors

Can then run a CBC experiment in less than 10 lines of code; easy to apply, reapply, experiment with
\end{frame}

\begin{frame}[plain,label={sec:org30ead4c}]{Control}
IMAGE

FH system with sine target; looks very reasonable

\begin{itemize}
\item Lightly tested: code runs, results look very reasonable
\begin{itemize}
\item Seems like a sensible output
\end{itemize}
\item Can easily write out the RHS of a PD-controlled FH system w/ sine target; can compare this explicit RHS to the code-generated system, to make sure the code isn't doing anything funny
\begin{itemize}
\item Haven't done this yet
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org0e0455e}]{Continuation}
\begin{itemize}
\item Runs a psuedo-arclength secant-predictor Newton-corrector CBC
\item Code is written now
\item Requires a `system': this is just a controlled model [from previous code], with its arguments binded
\item `system' interface will be easy to write, but haven't got round to this yet
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:org0ad523b}]{Simulation summary}
\begin{itemize}
\item Results handling is just something to take the set of natural periodic orbits, apply some measure (eg. amplitude), then plot them on a bifurcation diagram.
\item Should be working and tested within a week
\end{itemize}
\end{frame}


\section{Next steps}
\label{sec:orgd47e73c}
\begin{frame}[plain,label={sec:org562ebbc}]{Open questions}
\begin{itemize}
\item Will splines discretisation work?
\begin{itemize}
\item If splines can only model the signal to which the knots were fitted, they won't work for CBC
\item My guess is they will work
\end{itemize}

\item Stationary or adaptive mesh?
\begin{itemize}
\item If splines basis aren't good at generalising, can re-fit knots at each step, much like an adaptive mesh, which would hopefully fix problems
\end{itemize}

\item Efficient solving methods
\begin{itemize}
\item Remove zero-coefficients from discretisation
\item Broyden Jacobian update?
\item Newton-Picard iterations? Ludovic's suggestion of Newton-iterating on unstable coefficients, fixed-point iterating on stable coefficients; reduces the size of the Jacobian / finite differences step
\end{itemize}

\item Can we interface the code with Simulink?
\begin{itemize}
\item Ludovic has a simulink model that would be fun to play with; haven't looked at it yet since I've been testing the CBC codes; would be interesting to try to call the finished code from MATLAB, in which case we might be able to interface the two
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[plain,label={sec:orga31b052}]{Next steps}
\begin{itemize}
\item Continuation tutorial paper
\begin{itemize}
\item Haven't touched it recently
\item Making slower progress since I'm trying to get the stuff for this done before the paper deadline
\end{itemize}

\item NODYCON abstract for this: submitted, accepted

\item Conference paper for this: will start on that once the CBC simulation is sorted
\end{itemize}
\end{frame}
\end{document}
